In [1]:
import numpy as np
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
from sklearn.feature_extraction import DictVectorizer
from sklearn.model_selection import cross_val_score
from sklearn import metrics

C:\ProgramData\Anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
C:\ProgramData\Anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)

In [2]:
train_data = pd.read_csv('train.csv')

In [3]:
test_data = pd.read_csv('test.csv')

In [6]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
train_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
train_data.describe(include=['O'])

                               Name   Sex Ticket Cabin Embarked
count                           891   891    891   204      889
unique                          891     2    681   147        3
top     Goodwin, Mr. Charles Edward  male   1601    G6        S
freq                              1   577      7     4      644

In [16]:
train_data.describe(exclude='category')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Goodwin, Mr. Charles Edward",male,NaN,NaN,NaN,1601,NaN,G6,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

***fillna***

In [17]:
train_data['Age'].fillna(train_data['Age'].mean(), inplace=True)
test_data['Age'].fillna(test_data['Age'].mean(),inplace=True)

In [18]:
train_data['Fare'].fillna(train_data['Fare'].mean(), inplace=True)
test_data['Fare'].fillna(test_data['Fare'].mean(),inplace=True)

In [19]:
train_data['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [21]:
train_data['Embarked'].fillna('S', inplace=True)
test_data['Embarked'].fillna('S', inplace=True)

In [22]:
features = ['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked']

In [23]:
train_features = train_data[features]
train_labels = train_data['Survived']
test_features = test_data[features]

In [24]:
train_features.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

In [25]:
train_features.shape

(891, 7)

In [40]:
'''>>> df = pd.DataFrame({'col1': [1, 2],'col2': [0.5, 0.75]},index=['row1', 'row2'])

>>> df
      col1  col2
row1     1  0.50
row2     2  0.75

>>> df.to_dict()
{'col1': {'row1': 1, 'row2': 2}, 'col2': {'row1': 0.5, 'row2': 0.75}}

>>> df.to_dict('series')
{'col1': row1    1
         row2    2
Name: col1, dtype: int64,
'col2': row1    0.50
        row2    0.75
Name: col2, dtype: float64}

>>> df.to_dict('split')
{'index': ['row1', 'row2'], 'columns': ['col1', 'col2'],
 'data': [[1, 0.5], [2, 0.75]]}
 
>>> df.to_dict('records')
[{'col1': 1, 'col2': 0.5}, {'col1': 2, 'col2': 0.75}]

>>> df.to_dict('index')
{'row1': {'col1': 1, 'col2': 0.5}, 'row2': {'col1': 2, 'col2': 0.75}}
'''

">>> df = pd.DataFrame({'col1': [1, 2],'col2': [0.5, 0.75]},index=['row1', 'row2'])\n\n>>> df\n      col1  col2\nrow1     1  0.50\nrow2     2  0.75\n\n>>> df.to_dict()\n{'col1': {'row1': 1, 'row2': 2}, 'col2': {'row1': 0.5, 'row2': 0.75}}\n\n>>> df.to_dict('series')\n{'col1': row1    1\n         row2    2\nName: col1, dtype: int64,\n'col2': row1    0.50\n        row2    0.75\nName: col2, dtype: float64}\n\n>>> df.to_dict('split')\n{'index': ['row1', 'row2'], 'columns': ['col1', 'col2'],\n 'data': [[1, 0.5], [2, 0.75]]}\n \n>>> df.to_dict('records')\n[{'col1': 1, 'col2': 0.5}, {'col1': 2, 'col2': 0.75}]\n\n>>> df.to_dict('index')\n{'row1': {'col1': 1, 'col2': 0.5}, 'row2': {'col1': 2, 'col2': 0.75}}\n"

In [41]:
'''
DictVectorizer:
当特征的值是字符串时，这个转换器将进行一个二进制One-hot编码。One-hot编码是将特征所有可能的字符串值构造成布尔型值。
例如: 特征f有一个值ham，一个值spam，转换后会变成两个特征f=ham和f=spam。
注意，转换器只会将字符串形式的特征值转换成One-hot编码，数值型的不会转换
from sklearn.feature_extraction import DictVectorizer
 
    # 设置sparse=False获得numpy ndarray形式的结果
    v = DictVectorizer(sparse=False)
    D = [{"foo": 1, "bar": 2}, {"foo": 3, "baz": 1}]
 
    # 对字典列表D进行转换，转换成特征矩阵
    X = v.fit_transform(D)
    # 特征矩阵的行代表数据，列代表特征，0表示该数据没有该特征
    print(X)
    # 获取特征列名
    print(v.get_feature_names())
 
    # inverse_transform可以将特征矩阵还原成原始数据
    print(v.inverse_transform(X) == D)
 
    # 直接进行转换，不先进行拟合的话，无法识别新的特征
    print(v.transform([{"foo": 4, "unseen_feature": 3}]))
'''

'\nDictVectorizer:\n当特征的值是字符串时，这个转换器将进行一个二进制One-hot编码。One-hot编码是将特征所有可能的字符串值构造成布尔型值。\n例如: 特征f有一个值ham，一个值spam，转换后会变成两个特征f=ham和f=spam。\n注意，转换器只会将字符串形式的特征值转换成One-hot编码，数值型的不会转换\nfrom sklearn.feature_extraction import DictVectorizer\n \n    # 设置sparse=False获得numpy ndarray形式的结果\n    v = DictVectorizer(sparse=False)\n    D = [{"foo": 1, "bar": 2}, {"foo": 3, "baz": 1}]\n \n    # 对字典列表D进行转换，转换成特征矩阵\n    X = v.fit_transform(D)\n    # 特征矩阵的行代表数据，列代表特征，0表示该数据没有该特征\n    print(X)\n    # 获取特征列名\n    print(v.get_feature_names())\n \n    # inverse_transform可以将特征矩阵还原成原始数据\n    print(v.inverse_transform(X) == D)\n \n    # 直接进行转换，不先进行拟合的话，无法识别新的特征\n    print(v.transform([{"foo": 4, "unseen_feature": 3}]))\n'

In [26]:
dvec = DictVectorizer(sparse=False)
train_features = dvec.fit_transform(train_features.to_dict(orient='record'))

In [32]:
train_features.shape  # 对字符串特征值进行了one-hot编码

(891, 10)

In [31]:
pd.DataFrame(train_features).head()

      0    1    2    3        4    5    6    7    8    9
0  22.0  0.0  0.0  1.0   7.2500  0.0  3.0  0.0  1.0  1.0
1  38.0  1.0  0.0  0.0  71.2833  0.0  1.0  1.0  0.0  1.0
2  26.0  0.0  0.0  1.0   7.9250  0.0  3.0  1.0  0.0  0.0
3  35.0  0.0  0.0  1.0  53.1000  0.0  1.0  1.0  0.0  1.0
4  35.0  0.0  0.0  1.0   8.0500  0.0  3.0  0.0  1.0  0.0

In [33]:
# 构造ID3决策树
clf = DecisionTreeClassifier(criterion='entropy')

In [34]:
clf.fit(train_features, train_labels)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='entropy',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [35]:
test_features = dvec.transform(test_features.to_dict(orient='record'))

In [36]:
pred_labels = clf.predict(test_features)

In [39]:
round(clf.score(train_features, train_labels), 6)  #round() 方法返回浮点数x的四舍五入值。

0.982043

In [38]:
np.mean(cross_val_score(clf, train_features, train_labels, cv=10))

0.7756679151061173